/*************************************************************************
                             All Rights Reserved
                                 R&D Dept.
*************************************************************************/


/*************************************************************************

Filename:       cube_test.h

Description:    

Author:         

Date:           

Modify Log:      
 ------------------------------------------------------------------------
1.
 修改人  :                           
 修改时间:
 修改原因:
 修改方法:
 ------------------------------------------------------------------------
2.
 修改人  :                           
 修改时间:
 修改原因:
 修改方法:
 ------------------------------------------------------------------------
*************************************************************************/
#ifndef _CV_TEST_H_
#define _CV_TEST_H_



/***********************************************************************
*                                包含头文件
************************************************************************/


/***********************************************************************
*                                常量定义
***********************************************************************/


/***********************************************************************
*                                全局宏定义
***********************************************************************/


/***********************************************************************
*                                全局数据结构定义
***********************************************************************/
typedef struct
{
   unsigned char     useMultisample;
   unsigned char     usePreservingSwap;
   unsigned char     stretchToFit;
   int      vpW;
   int      vpH;
   int      bpp;
   int      frames;
   unsigned clientId;
} AppConfigCV;


/***********************************************************************
*                                导出函数
***********************************************************************/
void InitOpenCVGLState(void);
void InitOpenCVGLViewPort(unsigned int width, unsigned int height, float panelAspect, unsigned char stretch);
void OpenCVViewResize(void);
void OpenCVViewDisplay();
void restoreDateStatic(unsigned char *pARGB32 , unsigned int size);
void* testFunctionPauseResume(void* args);
void afterBasckgroundCut();


#endif